Revit 2015 API
DefaultDivideSettings.GetDistance Method
 Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines. This method is obsolete in Revit 2015. Use getSurfaceDistance instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public double GetDistance(
	UVGridlineType gridlines
)
Visual Basic
<ObsoleteAttribute> _
Public Function GetDistance ( _
	gridlines As UVGridlineType _
) As Double
Visual C++
[ObsoleteAttribute]
public:
double GetDistance(
	UVGridlineType gridlines
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
Return Value
 The default distance for the layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace